app/Controllers/Admin/ChatController.php

    public function fetch($complaintId)
    {
        // Verify complaint exists
        $complaint = $this->complaintModel->find($complaintId);
        if (!$complaint) {
            return $this->response->setJSON([
                'success' => false,
                'message' => 'Complaint not found'
            ]);
        }

        // Get all chats including internal notes
        $chats = $this->chatModel
            ->select('chats.*, users.full_name, users.role')
            ->join('users', 'users.id = chats.user_id')
            ->where('chats.complaint_id', $complaintId)
            ->orderBy('chats.created_at', 'ASC')
            ->findAll();
---
SELECT *
FROM `complaints`
WHERE `complaints`.`id` = '20'
SELECT `chats`.*, `users`.`full_name`, `users`.`role`
FROM `chats`
JOIN `users` ON `users`.`id` = `chats`.`user_id`
WHERE `chats`.`complaint_id` = '20'
ORDER BY `chats`.`created_at` ASC