app/Controllers/Admin/ComplaintController.php

    public function show($id)
    {
        // Get complaint with relations
        $complaint = $this->complaintModel
            ->select('complaints.*, applications.name as application_name, categories.name as category_name, users.full_name as user_name, users.email as user_email')
            ->join('applications', 'applications.id = complaints.application_id')
            ->join('users', 'users.id = complaints.user_id')
            ->join('categories', 'categories.id = complaints.category_id', 'left')
            ->where('complaints.id', $id)
            ->first();

        if (!$complaint) {
            return redirect()->to('admin/complaints')
                           ->with('error', 'Laporan tidak ditemukan');
        }

        // Get user info
        $user = $this->userModel->find($complaint->user_id);

        // Get attachments
        $attachments = $this->attachmentModel->getAttachmentsByComplaint($id);

        // Get history
        $history = $this->historyModel
            ->select('complaint_history.*, users.full_name as user_name, users.role')
            ->join('users', 'users.id = complaint_history.user_id')
            ->where('complaint_id', $id)
            ->orderBy('created_at', 'DESC')
            ->findAll();
---
SELECT `complaints`.*, `applications`.`name` as `application_name`, `categories`.`name` as `category_name`, `users`.`full_name` as `user_name`, `users`.`email` as `user_email`
FROM `complaints`
JOIN `applications` ON `applications`.`id` = `complaints`.`application_id`
JOIN `users` ON `users`.`id` = `complaints`.`user_id`
LEFT JOIN `categories` ON `categories`.`id` = `complaints`.`category_id`
WHERE `complaints`.`id` = '25'
 LIMIT 1
SELECT *
FROM `users`
WHERE `users`.`id` = 7
SELECT `complaint_history`.*, `users`.`full_name` as `user_name`, `users`.`role`
FROM `complaint_history`
JOIN `users` ON `users`.`id` = `complaint_history`.`user_id`
WHERE `complaint_id` = '25'
ORDER BY `created_at` DESC

        // Get admin info if assigned
        $admin = null;
        if ($complaint->assigned_to) {
            $admin = $this->userModel->find($complaint->assigned_to);
---
SELECT *
FROM `users`
WHERE `users`.`id` = 1