app/Controllers/User/ComplaintController.php

    public function show($id)
    {
        $userId = session()->get('user_id');

        // Get complaint with relations
        $complaint = $this->complaintModel
            ->select('complaints.*, applications.name as application_name, categories.name as category_name, users.full_name as user_name')
            ->join('applications', 'applications.id = complaints.application_id')
            ->join('users', 'users.id = complaints.user_id')
            ->join('categories', 'categories.id = complaints.category_id', 'left')
            ->where('complaints.id', $id)
            ->first();

        if (!$complaint) {
            return redirect()->to('user/complaints')
                ->with('error', 'Laporan tidak ditemukan');
        }

        // Check ownership
        if ($complaint->user_id != $userId) {
            return redirect()->to('user/complaints')
                ->with('error', 'Anda tidak memiliki akses ke laporan ini');
        }

        // Get attachments
        $attachments = $this->attachmentModel->getAttachmentsByComplaint($id);

        // Get history
        $history = $this->historyModel
            ->select('complaint_history.*, users.full_name as user_name')
            ->join('users', 'users.id = complaint_history.user_id')
            ->where('complaint_id', $id)
            ->orderBy('created_at', 'DESC')
            ->findAll();
---
SELECT `complaints`.*, `applications`.`name` as `application_name`, `categories`.`name` as `category_name`, `users`.`full_name` as `user_name`
FROM `complaints`
JOIN `applications` ON `applications`.`id` = `complaints`.`application_id`
JOIN `users` ON `users`.`id` = `complaints`.`user_id`
LEFT JOIN `categories` ON `categories`.`id` = `complaints`.`category_id`
WHERE `complaints`.`id` = '25'
 LIMIT 1
SELECT `complaint_history`.*, `users`.`full_name` as `user_name`
FROM `complaint_history`
JOIN `users` ON `users`.`id` = `complaint_history`.`user_id`
WHERE `complaint_id` = '25'
ORDER BY `created_at` DESC

        $admin = null;
        if ($complaint->assigned_to) {
            $userModel = new \App\Models\UserModel();
            $admin = $userModel->find($complaint->assigned_to);
---
SELECT *
FROM `users`
WHERE `users`.`id` = 1