app/Controllers/User/FeedbackController.php

SELECT `complaints`.*, `applications`.`name` as `application_name`
FROM `complaints`
JOIN `applications` ON `applications`.`id` = `complaints`.`application_id`
WHERE `complaints`.`id` = '6'
 LIMIT 1
---
    public function create($complaintId)
    {
        $userId = session()->get('user_id');

        // Get complaint
        $complaint = $this->complaintModel
            ->select('complaints.*, applications.name as application_name')
            ->join('applications', 'applications.id = complaints.application_id')
            ->where('complaints.id', $complaintId)
            ->first();