app/Controllers/Superadmin/DashboardController.php

SELECT COUNT(*) AS `numrows`
FROM `users`
---
    public function index()
    {
        $stats = $this->complaintModel->getGlobalStats();
        $totalUsers = $this->userModel->countAllResults();