app/Controllers/Superadmin/UserManagementController.php

SELECT *
FROM `users`
ORDER BY `created_at` DESC
---
    public function index()
    {
        $users = $this->userModel->orderBy('created_at', 'DESC')->findAll();

DELETE FROM `users`
WHERE `id` IN ('7')
---
    public function delete($id)
    {
        if ($this->userModel->delete($id)) {