app/Controllers/Home.php

    protected function getRecentPublicComplaints(int $limit = 5): array
    {
        $complaints = $this->complaintModel
            ->select('complaints.id, complaints.title, complaints.priority, complaints.status, complaints.created_at, applications.name as application_name')
            ->join('applications', 'applications.id = complaints.application_id')
            ->orderBy('complaints.created_at', 'DESC')
            ->limit($limit)
            ->findAll();
---
SELECT `complaints`.`id`, `complaints`.`title`, `complaints`.`priority`, `complaints`.`status`, `complaints`.`created_at`, `applications`.`name` as `application_name`
FROM `complaints`
JOIN `applications` ON `applications`.`id` = `complaints`.`application_id`
ORDER BY `complaints`.`created_at` DESC
 LIMIT 5