app/Models/ApplicationModel.php

SELECT *
FROM `applications`
WHERE `is_active` = 1
ORDER BY `name` ASC
---
    public function getActiveApplications(): array
    {
        return $this->where('is_active', 1)
                    ->orderBy('name', 'ASC')
                    ->findAll();