app/Models/AttachmentModel.php

    public function getAttachmentsByComplaint(int $complaintId): array
    {
        return $this->where('complaint_id', $complaintId)
                    ->orderBy('created_at', 'ASC')
                    ->findAll();
---
SELECT *
FROM `attachments`
WHERE `complaint_id` = 25
ORDER BY `created_at` ASC