app/Models/CategoryModel.php

SELECT *
FROM `categories`
WHERE `is_active` = 1
ORDER BY `name` ASC
---
    public function getActiveCategories(): array
    {
        return $this->where('is_active', 1)
                    ->orderBy('name', 'ASC')
                    ->findAll();