app/Models/ComplaintModel.php

SELECT COUNT(*) AS `numrows`
FROM `complaints`
WHERE `status` = 'pending'
SELECT COUNT(*) AS `numrows`
FROM `complaints`
WHERE `status` = 'in_progress'
SELECT COUNT(*) AS `numrows`
FROM `complaints`
WHERE `status` = 'resolved'
SELECT COUNT(*) AS `numrows`
FROM `complaints`
WHERE `status` = 'closed'
SELECT COUNT(*) AS `numrows`
FROM `complaints`
WHERE `priority` = 'urgent'
AND `status` NOT IN ('closed')
---
    public function getGlobalStats(): array
    {
        return [
            'total'       => $this->countAllResults(),
            'pending'     => $this->where('status', 'pending')->countAllResults(),
            'in_progress' => $this->where('status', 'in_progress')->countAllResults(),
            'resolved'    => $this->where('status', 'resolved')->countAllResults(),
            'closed'      => $this->where('status', 'closed')->countAllResults(),
            'urgent'      => $this->where('priority', 'urgent')->whereNotIn('status', ['closed'])->countAllResults(),