app/Models/ComplaintModel.php

SELECT *
FROM `complaints`
WHERE `user_id` = 5
ORDER BY `created_at` DESC
---
    public function getComplaintsByUser(int $userId, ?string $status = null): array
    {
        $builder = $this->where('user_id', $userId);

        if ($status) {
            $builder->where('status', $status);
        }

        return $builder->orderBy('created_at', 'DESC')->findAll();

SELECT COUNT(*) AS `numrows`
FROM `complaints`
WHERE `user_id` = 5
AND `status` = 'pending'
SELECT COUNT(*) AS `numrows`
FROM `complaints`
WHERE `user_id` = 5
AND `status` = 'in_progress'
SELECT COUNT(*) AS `numrows`
FROM `complaints`
WHERE `user_id` = 5
AND `status` = 'resolved'
SELECT COUNT(*) AS `numrows`
FROM `complaints`
WHERE `user_id` = 5
AND `status` = 'closed'
---
    public function getUserComplaintStats(int $userId): array
    {
        return [
            'total'       => $this->where('user_id', $userId)->countAllResults(),
            'pending'     => $this->where(['user_id' => $userId, 'status' => 'pending'])->countAllResults(),
            'in_progress' => $this->where(['user_id' => $userId, 'status' => 'in_progress'])->countAllResults(),
            'resolved'    => $this->where(['user_id' => $userId, 'status' => 'resolved'])->countAllResults(),
            'closed'      => $this->where(['user_id' => $userId, 'status' => 'closed'])->countAllResults(),

SELECT *
FROM `complaints`
ORDER BY `created_at` DESC
---
    public function getAllComplaints(?array $filters = null): array
    {
        $builder = $this;

        if ($filters) {
            if (!empty($filters['status'])) {
                $builder->where('status', $filters['status']);
            }
            if (!empty($filters['priority'])) {
                $builder->where('priority', $filters['priority']);
            }
            if (!empty($filters['application_id'])) {
                $builder->where('application_id', $filters['application_id']);
            }
            if (!empty($filters['assigned_to'])) {
                $builder->where('assigned_to', $filters['assigned_to']);
            }
            if (!empty($filters['date_from'])) {
                $builder->where('created_at >=', $filters['date_from']);
            }
            if (!empty($filters['date_to'])) {
                $builder->where('created_at <=', $filters['date_to']);
            }
        }

        return $builder->orderBy('created_at', 'DESC')->findAll();

SELECT COUNT(*) AS `numrows`
FROM `complaints`
WHERE `status` = 'pending'
SELECT COUNT(*) AS `numrows`
FROM `complaints`
WHERE `status` = 'in_progress'
SELECT COUNT(*) AS `numrows`
FROM `complaints`
WHERE `status` = 'resolved'
SELECT COUNT(*) AS `numrows`
FROM `complaints`
WHERE `status` = 'closed'
SELECT COUNT(*) AS `numrows`
FROM `complaints`
WHERE `priority` = 'urgent'
AND `status` NOT IN ('closed')
---
    public function getGlobalStats(): array
    {
        return [
            'total'       => $this->countAllResults(),
            'pending'     => $this->where('status', 'pending')->countAllResults(),
            'in_progress' => $this->where('status', 'in_progress')->countAllResults(),
            'resolved'    => $this->where('status', 'resolved')->countAllResults(),
            'closed'      => $this->where('status', 'closed')->countAllResults(),
            'urgent'      => $this->where('priority', 'urgent')->whereNotIn('status', ['closed'])->countAllResults(),