app/Models/FeedbackModel.php

    public function getFeedbackByComplaint(int $complaintId): ?Feedback
    {
        return $this->where('complaint_id', $complaintId)->first();
---
SELECT *
FROM `feedbacks`
WHERE `complaint_id` = 25
 LIMIT 1