app/Models/KnowledgeBaseModel.php

SELECT *
FROM `knowledge_base`
WHERE `is_published` = 1
ORDER BY `created_at` DESC
---
    public function getPublishedArticles(?int $limit = null): array
    {
        $builder = $this->where('is_published', 1)
                        ->orderBy('created_at', 'DESC');

        if ($limit) {
            $builder->limit($limit);
        }

        return $builder->findAll();

SELECT *
FROM `knowledge_base`
WHERE `is_published` = 1
ORDER BY `view_count` DESC
 LIMIT 3
---
    public function getPopularArticles(int $limit = 5): array
    {
        return $this->where('is_published', 1)
                    ->orderBy('view_count', 'DESC')
                    ->limit($limit)
                    ->findAll();