app/Models/NotificationModel.php

    public function getNotificationsByUser(int $userId, ?bool $unreadOnly = false): array
    {
        $builder = $this->where('user_id', $userId);

        if ($unreadOnly) {
            $builder->where('is_read', 0);
        }

        return $builder->orderBy('created_at', 'DESC')->findAll();
---
SELECT *
FROM `notifications`
WHERE `user_id` = 2
ORDER BY `created_at` DESC

    public function countUnread(int $userId): int
    {
        return $this->where('user_id', $userId)
                    ->where('is_read', 0)
                    ->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `notifications`
WHERE `user_id` = 2
AND `is_read` = 0