app/Models/UserModel.php

SELECT *
FROM `users`
WHERE `email` = 'demo@example.com'
 LIMIT 1
---
    public function getUserByEmail(string $email): ?User
    {
        return $this->where('email', $email)->first();

SELECT *
FROM `users`
WHERE `role` IN ('admin','superadmin')
AND `is_active` = 1
---
    public function getAllAdmins(): array
    {
        return $this->whereIn('role', ['admin', 'superadmin'])
                    ->where('is_active', 1)
                    ->findAll();