app/Views/admin/complaints/index.php

                                <td>
                                    <?php
                                    $userModel = new \App\Models\UserModel();
                                    $user = $userModel->find($complaint->user_id);
---
SELECT *
FROM `users`
WHERE `users`.`id` = 5

                                <td>
                                    <?php if ($complaint->assigned_to): ?>
                                        <?php
                                        $admin = $userModel->find($complaint->assigned_to);
---
SELECT *
FROM `users`
WHERE `users`.`id` = 2